 
if(window.location.href.search("bsn=60076")!=-1 && window.location.href.search("gamer.com.tw/B.php")!=-1){
    let banList = [
		/*  請把不適用的項目整行移除  */
		2980113, /*  英雄聯盟  */
		3650506, /*  崩壞 3rd  */
		3790298, /*  少女前線  */
		3975870, /*  碧藍航線  */
		4465319, /*  少女前線  */
		4523218, /*  永遠的七日之都  */
		5086930, /*  明日方舟  */
		5503284, /*  重裝戰姬  */
		5679653, /*  符文大地傳說  */
		5113198, /*  雀魂 / 雀姬  */
		6150285, /*  碧藍檔案  */
		3500784, /*  Warframe  */
		3542402, /*  Path of Exile   */
		6200868, /*  少女前線  */
		4806662, /*  魔法紀錄 魔法少女小圓外傳  */
		4491469, /*  梅露可物語  */
		6216651, /*  原神  */
		6138993, /*  未來戰  */
		4442119, /*  部落衝突  */
		5270484, /*  Phigros  */
		4817620, /*  最終休止符  */
		6465517, /*  天地劫  */
		6485195, /*  原神  */
		6496312, /*  原神  */
		4870165, /*  戰爭雷霆  */
		6491990, /*  原神  */
		4858722, /*  荒野亂鬥  */
		5248094, /*  碧藍航線  */
		6563244, /*  原神  */
		6597293, /*  原神  */
		6160278, /*  原神 (宣傳  */
		6631597, /*  原神 (宣傳  */
		6631506, /*  原神 (宣傳  */
		5299995, /*  食物語  */
		6625387, /*  原神  */
		6491670, /*  Muse Dash  */
		6631356, /*  白夜極光  */
		5835317, /*  守望傳說  */
		6560747, /*  原神  */
		6656986, /*  原神  */
		6479686, /*  原神  */
		6674300, /*  原神  */
		6679508, /*  楓之谷R  */
		6677466, /*  原神  */
		6701593, /*  原神  */
		6700084, /*  英雄聯盟  */
		6656203, /*  碧藍檔案  */
		6718131, /*  碧藍航線  */
		6515165, /*  原神  */
		6716890, /*  原神  */
    ];

	let nameBanList = [];
	
	banList.forEach(function(banItem){
		nameBanList[banItem] = true;
	})
	
	document.querySelectorAll(".b-list__row").forEach(function(node) {
		if(node && node.children[1] &&
			node.children[1].children[0] &&
			node.children[1].children[0].href &&
			nameBanList[node.children[1].children[0].href.replace(
					"https://forum.gamer.com.tw/C.php?bsn=60076&snA=","").replace(/&.*/,'')
				])
				node.remove();
	});
}